app/Controllers/Admin/Categorias.php

SELECT *
FROM `categoria`
---
    public function index()
    {
        $categoriaModel = new CategoriaModel();
        echo view('Categoria/index', [
            'Categorias' => $categoriaModel->findAll()
        ]);