app/Controllers/Admin/Libros.php

SELECT *
FROM `libros`
SELECT *
FROM `categoria`
---
    public function index()
    {
        $categoriaModel = new CategoriaModel();
        $libroModel = new LibroModel();
        echo view('Libro/index', [
            'Libros' => $libroModel->findAll(),

            'categorias' => $categoriaModel->findAll()
        ]);

SELECT *
FROM `libros`
WHERE `libros`.`id` = '41'
SELECT *
FROM `categoria`
---
    public function edit($id)
    {
        $libroModel = new LibroModel();
        $categoriaModel = new CategoriaModel();
        $libro = $libroModel->find($id);
        echo view('Libro/edit', [
            'libros' => $libro,

            'categorias' => $categoriaModel->find()

SELECT *
FROM `libros`
WHERE `libros`.`id` = '41'
SELECT *
FROM `categoria`
WHERE `categoria`.`id` = '60'
---
    public function show($id)
    {
        $libroModel = new LibroModel();
        $categoriaModel = new CategoriaModel();
        //  var_dump($librosModel->find($id));
        $libro = $libroModel->find($id);
        echo view('Libro/show', [
            'libro' => $libro,
            'categoria' =>  $categoriaModel->find($libro['categoria_id']),