app/Controllers/Admin/Usuarios.php

    public function login_post()
    {
        $usuarioModel = new UsuarioModel();

        $email = $this->request->getPost('email');
        $contrasena = $this->request->getPost('contrasena');

        $usuario = $usuarioModel->select('id, usuario, email, contrasena, tipo')
        ->orwhere('email',$email)
        ->orwhere('usuario',$email)
        ->first();
---
SELECT `id`, `usuario`, `email`, `contrasena`, `tipo`
FROM `usuarios`
WHERE `email` = 'admin'
OR `usuario` = 'admin'
 LIMIT 1

public function register_post(){
    $usuarioModel = new UsuarioModel();

    if($this->validate('usuario'))
    {
        $usuarioModel->insert([
            'usuario' => $this->request->getPost('usuario'),
            'email' => $this->request->getPost('email'),
            'contrasena' => $usuarioModel->contrasenaHash($this->request->getPost('contrasena'))
        ]);
---
INSERT INTO `usuarios` (`usuario`, `email`, `contrasena`) VALUES ('qweqeqw', 'aramos@ceabc.gob.mx', '$2y$10$mQm3UrQqlsM3TJdpmWkXn.f6X5AOSUkSW.fKIfgWw1y52koYETNaC')