app/Controllers/Categorias.php

    public function index()
    {
        $categoriaModel = new CategoriaModel();
        echo view('Categoria', [
            'Categorias' => $categoriaModel->findAll()
        ]);
---
SELECT *
FROM `categoria`

    public function edit($id)
    {
        $categoriaModel = new CategoriaModel();

        echo view('categoria/edit', [
            'categorias' => $categoriaModel->find($id)
        ]);
---
SELECT *
FROM `categoria`
WHERE `categoria`.`id` = ' 1'