app/Controllers/Libros.php

SELECT *
FROM `libros`
---
    public function index()
    {
        $libroModel = new LibroModel();
        echo view('Libreria', [
            'Libros' => $libroModel->findAll()
        ]);

SELECT *
FROM `libros`
WHERE `libros`.`id` = ' 1'
---
    public function edit($id)
    {
        $libroModel = new LibroModel();

        echo view('Libro/edit', [
            'libros' => $libroModel->find($id)
        ]);